
public class Ex4 {

	public static void main(String[] args) {

		int a;
		a=10;
		System.out.println(a);
		
		/*아 리터럴~~~~~ 10 저장
		 * 그걸 대입이라고 표현합니다 그죠?
		 * 10을 a라는 변수에 집어넣을거에요 그죠오
		 * 이거 되게 낯설져 그져?
		 * 이거 헷갈리시면은 그냥 일단은 설명 들으시고요
		 * 일단은 나중에 한번 생각하시면서 정리하시면  돼요
		 * a라고 하는 정수를 담을 수 있는 a라고 하는 변수에 집어넣는겁니다.
		 * 대입하는거에요
		 * 이과정을 뭐라고 하냐
		 * 초!기!화!라고 해요
		 * 씨스오~ 컨트롤스페이스 하시구여
		 * 그래서 컨트롤에프십일번눌러보시면요~
		 * 나 a를 출력하고싶다~ 그러면여
		 * a라고 하는거는 작은따음표가 있고
		 * 이때는 문자형 리터럴 햐셔야됩미당
		 * 작은 따옴표를 빼버리면요
		 * 빼버리면 10이라고하는 데이터를 담고있는 a라고하는 상자 변수를 출력하는거고요
		 * 요부분지금 볼거에요~s
		 * */
	}

}
